def Вывести_в_консоль_1():
    print(1,end="")
def Вывести_в_консоль_2():
    print(2,end="")
def Вывести_в_консоль_3():
    print(3,end="")
def Вывести_в_консоль_4():
    print(4,end="")
def Вывести_в_консоль_5():
    print(5,end="")
def Вывести_в_консоль_6():
    print(6,end="")
def Вывести_в_консоль_7():
    print(7,end="")
def Вывести_в_консоль_8():
    print(8,end="")
def Вывести_в_консоль_9():
    print(9,end="")
def Вывести_в_консоль_0():
    print(0,end="")
Вывести_в_консоль_8(), Вывести_в_консоль_8(),Вывести_в_консоль_0(), Вывести_в_консоль_0(), Вывести_в_консоль_5(), Вывести_в_консоль_5(), Вывести_в_консоль_5(), Вывести_в_консоль_3(), Вывести_в_консоль_5(), Вывести_в_консоль_3(), Вывести_в_консоль_5(),