def bank(Х,Y): #создаем функцию где пользователь делает вклад в размере Х рублей сроком на Y лет
    for each_year in range(Y): #добавляем к этому что размер вклада увеличивается на 10% годовых или на(1.1)
        Х = (Х * 1.1) 
    return Х # возвращаем ответ сколько получим итого денег

Х=int(input("Сколько денег вкладываем?: ")) #запрашиваем у пользователя сумму вклада

Y=int(input("На сколько лет?: ")) #запрашиваем у пользователя на какой срок вклад

print(bank(Х,Y)) #выводим ответ банка о получившейся сумме за объявленный срок