# первый способ нахождения площади квадрата
s=float(input("Enter side of square")) # Принимаем ввод стороны от пользователя
area=s*s #  Вычислеяем площадь
print("Area of square=", '%.1f' %area) # Выводим область с помощью "%.1f",для получения 1 цифры после запятой, а f указывает значение с плавающей точкой.

#второй способ нахождения площади квадрата
def square(n): # Определяем функцию square() для вычисления площади, используя ввод стороны от пользователя     
    area = pow(n,2) # Вызоваем pow() и задаем параметры как n, 2 для вычисления площади   
    return area # возвращаем ответ
    
num=float(input("Enter number") ) # Принимаем входные данные от пользователя
print("Sum of digits",square(num)) # Выводим площадь